In [1]:
import pandas as pd
import numpy as np

In [2]:
ser = pd.Series([0,1, np.nan, "hello", complex(3,2)])

In [3]:
ser

0         0
1         1
2       NaN
3     hello
4    (3+2j)
dtype: object

In [6]:
ser

0         0
1         1
2       NaN
3     hello
4    (3+2j)
dtype: object

In [12]:
df = pd.DataFrame({"Name":["Ross", "Rachel", "Monica", "Chandler", "Phoebe"], "Age":[42,45,25,7,22], "Profession":["Actor", "Homemaker","Actress", "mom", "AirHostess"]})

In [15]:
for ind, data in df.iterrows():
    print(ind, ":", data)

0 : Name           Ross
Age              42
Profession    Actor
Name: 0, dtype: object
1 : Name             Rachel
Age                  45
Profession    Homemaker
Name: 1, dtype: object
2 : Name           Monica
Age                25
Profession    Actress
Name: 2, dtype: object
3 : Name          Chandler
Age                  7
Profession         mom
Name: 3, dtype: object
4 : Name              Phoebe
Age                   22
Profession    AirHostess
Name: 4, dtype: object

In [16]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, Name='Ross', Age=42, Profession='Actor')
Pandas(Index=1, Name='Rachel', Age=45, Profession='Homemaker')
Pandas(Index=2, Name='Monica', Age=25, Profession='Actress')
Pandas(Index=3, Name='Chandler', Age=7, Profession='mom')
Pandas(Index=4, Name='Phoebe', Age=22, Profession='AirHostess')

In [17]:
for (ind, data) in df.iterrows():
    print(ind, ":", data)

0 : Name           Ross
Age              42
Profession    Actor
Name: 0, dtype: object
1 : Name             Rachel
Age                  45
Profession    Homemaker
Name: 1, dtype: object
2 : Name           Monica
Age                25
Profession    Actress
Name: 2, dtype: object
3 : Name          Chandler
Age                  7
Profession         mom
Name: 3, dtype: object
4 : Name              Phoebe
Age                   22
Profession    AirHostess
Name: 4, dtype: object

In [18]:
df.Age.apply(np.sqrt)

0    6.480741
1    6.708204
2    5.000000
3    2.645751
4    4.690416
Name: Age, dtype: float64

In [19]:
lst = pd.MultiIndex.from_frame(df)

In [24]:
lst

MultiIndex([(    'Ross', 42,      'Actor'),
            (  'Rachel', 45,  'Homemaker'),
            (  'Monica', 25,    'Actress'),
            ('Chandler',  7,        'mom'),
            (  'Phoebe', 22, 'AirHostess')],
           names=['Name', 'Age', 'Profession'])

In [22]:
lst[0][0]

'Ross'

In [23]:
lst[-1][-1]

'AirHostess'

In [26]:
df.reindex([2,5,3,1,0])

       Name   Age Profession
2    Monica  25.0    Actress
5       NaN   NaN        NaN
3  Chandler   7.0        mom
1    Rachel  45.0  Homemaker
0      Ross  42.0      Actor

In [28]:
df2 = pd.DataFrame({"Name":["Ross", "Rachel", "Monica", "Chandler", "Phoebe"], "Martial Status":["yes","No","yes","No","yes"]})

In [29]:
newdf = df.merge(df2, on="Name")

In [30]:
newdf

       Name  Age  Profession Martial Status
0      Ross   42       Actor            yes
1    Rachel   45   Homemaker             No
2    Monica   25     Actress            yes
3  Chandler    7         mom             No
4    Phoebe   22  AirHostess            yes

In [33]:
newdf2 = pd.concat([df,df2['Martial Status']], axis=1)

In [34]:
newdf2

       Name  Age  Profession Martial Status
0      Ross   42       Actor            yes
1    Rachel   45   Homemaker             No
2    Monica   25     Actress            yes
3  Chandler    7         mom             No
4    Phoebe   22  AirHostess            yes

In [48]:
df2['Martial Status'] = df2['Martial Status'].map({np.nan:"Yes"})

In [49]:
df2

       Name Martial Status
0      Ross            Yes
1    Rachel            Yes
2    Monica            Yes
3  Chandler            Yes
4    Phoebe            Yes

In [52]:
df2

       Name Martial Status
0      Ross            Yes
1    Rachel            Yes
2    Monica            Yes
3  Chandler            Yes
4    Phoebe            Yes

In [53]:
df3 = df[["Name","Profession"]].applymap(lambda x:len(x))

/tmp/ipykernel_22095/1046684733.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df3 = df[["Name","Profession"]].applymap(lambda x:len(x))

In [54]:
df3

   Name  Profession
0     4           5
1     6           9
2     6           7
3     8           3
4     6          10

In [55]:
df4 = df[["Name","Profession"]].apply(lambda x:type(x), axis=1)

In [56]:
df4

0    <class 'pandas.core.series.Series'>
1    <class 'pandas.core.series.Series'>
2    <class 'pandas.core.series.Series'>
3    <class 'pandas.core.series.Series'>
4    <class 'pandas.core.series.Series'>
dtype: object

In [57]:
df2

       Name Martial Status
0      Ross            Yes
1    Rachel            Yes
2    Monica            Yes
3  Chandler            Yes
4    Phoebe            Yes

In [60]:
df2.shape

(5, 2)

In [61]:
df_s = ser.to_frame()

In [62]:
df_s

        0
0       0
1       1
2     NaN
3   hello
4  (3+2j)

In [63]:
df["Profession"]

0         Actor
1     Homemaker
2       Actress
3           mom
4    AirHostess
Name: Profession, dtype: object

In [64]:
df["Profession"] = pd.Categorical(df["Profession"]).codes

In [65]:
df

       Name  Age  Profession
0      Ross   42           0
1    Rachel   45           3
2    Monica   25           1
3  Chandler    7           4
4    Phoebe   22           2

In [67]:
dummy = pd.get_dummies(df, columns=["Profession"], dtype=int)

In [68]:
dummy

,Name,Age,Profession_0,Profession_1,Profession_2,Profession_3,Profession_4
0,Ross,42,1,0,0,0,0
1,Rachel,45,0,0,0,1,0
2,Monica,25,0,1,0,0,0
3,Chandler,7,0,0,0,0,1
4,Phoebe,22,0,0,1,0,0

In [69]:
df.Age

0    42
1    45
2    25
3     7
4    22
Name: Age, dtype: int64

In [70]:
df.Age.mean()

np.float64(28.2)

In [71]:
df.Age.std()

np.float64(15.578831791889918)

In [72]:
df.Age.median()

np.float64(25.0)

In [73]:
df.Age.var()

np.float64(242.70000000000002)

In [74]:
df.Age.sum()

np.int64(141)

In [76]:
df.sort_values(by='Profession', ascending=True)

       Name  Age  Profession
0      Ross   42           0
2    Monica   25           1
4    Phoebe   22           2
1    Rachel   45           3
3  Chandler    7           4